grevaillot/svd_tools/headers/STM32F105xx/usb_otg_device.h
#pragma once 

/* --- USB_OTG_DEVICE: USB on the go full speed --------------------- */

/** @defgroup usb_otg_device_registers USB on the go full speed Register
@{*/

/** USB_OTG_DEVICE_FS_DCFG OTG_FS device configuration register (OTG_FS_DCFG) **/
#define USB_OTG_DEVICE_FS_DCFG			MMIO32(USB_OTG_DEVICE_BASE + 0x00)
/** USB_OTG_DEVICE_FS_DCTL OTG_FS device control register (OTG_FS_DCTL) **/
#define USB_OTG_DEVICE_FS_DCTL			MMIO32(USB_OTG_DEVICE_BASE + 0x04)
/** USB_OTG_DEVICE_FS_DSTS OTG_FS device status register (OTG_FS_DSTS) **/
#define USB_OTG_DEVICE_FS_DSTS			MMIO32(USB_OTG_DEVICE_BASE + 0x08)
/** USB_OTG_DEVICE_FS_DIEPMSK OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK) **/
#define USB_OTG_DEVICE_FS_DIEPMSK			MMIO32(USB_OTG_DEVICE_BASE + 0x10)
/** USB_OTG_DEVICE_FS_DOEPMSK OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK) **/
#define USB_OTG_DEVICE_FS_DOEPMSK			MMIO32(USB_OTG_DEVICE_BASE + 0x14)
/** USB_OTG_DEVICE_FS_DAINT OTG_FS device all endpoints interrupt register (OTG_FS_DAINT) **/
#define USB_OTG_DEVICE_FS_DAINT			MMIO32(USB_OTG_DEVICE_BASE + 0x18)
/** USB_OTG_DEVICE_FS_DAINTMSK OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK) **/
#define USB_OTG_DEVICE_FS_DAINTMSK			MMIO32(USB_OTG_DEVICE_BASE + 0x1c)
/** USB_OTG_DEVICE_DVBUSDIS OTG_FS device VBUS discharge time register **/
#define USB_OTG_DEVICE_DVBUSDIS			MMIO32(USB_OTG_DEVICE_BASE + 0x28)
/** USB_OTG_DEVICE_DVBUSPULSE OTG_FS device VBUS pulsing time register **/
#define USB_OTG_DEVICE_DVBUSPULSE			MMIO32(USB_OTG_DEVICE_BASE + 0x2c)
/** USB_OTG_DEVICE_DIEPEMPMSK OTG_FS device IN endpoint FIFO empty interrupt mask register **/
#define USB_OTG_DEVICE_DIEPEMPMSK			MMIO32(USB_OTG_DEVICE_BASE + 0x34)
/** USB_OTG_DEVICE_FS_DIEPCTL0 OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0) **/
#define USB_OTG_DEVICE_FS_DIEPCTL0			MMIO32(USB_OTG_DEVICE_BASE + 0x100)
/** USB_OTG_DEVICE_DIEPINT0 device endpoint-x interrupt register **/
#define USB_OTG_DEVICE_DIEPINT0			MMIO32(USB_OTG_DEVICE_BASE + 0x108)
/** USB_OTG_DEVICE_DIEPTSIZ0 device endpoint-0 transfer size register **/
#define USB_OTG_DEVICE_DIEPTSIZ0			MMIO32(USB_OTG_DEVICE_BASE + 0x110)
/** USB_OTG_DEVICE_DTXFSTS0 OTG_FS device IN endpoint transmit FIFO status register **/
#define USB_OTG_DEVICE_DTXFSTS0			MMIO32(USB_OTG_DEVICE_BASE + 0x118)
/** USB_OTG_DEVICE_DIEPCTL1 OTG device endpoint-1 control register **/
#define USB_OTG_DEVICE_DIEPCTL1			MMIO32(USB_OTG_DEVICE_BASE + 0x120)
/** USB_OTG_DEVICE_DIEPINT1 device endpoint-1 interrupt register **/
#define USB_OTG_DEVICE_DIEPINT1			MMIO32(USB_OTG_DEVICE_BASE + 0x128)
/** USB_OTG_DEVICE_DIEPTSIZ1 device endpoint-1 transfer size register **/
#define USB_OTG_DEVICE_DIEPTSIZ1			MMIO32(USB_OTG_DEVICE_BASE + 0x130)
/** USB_OTG_DEVICE_DTXFSTS1 OTG_FS device IN endpoint transmit FIFO status register **/
#define USB_OTG_DEVICE_DTXFSTS1			MMIO32(USB_OTG_DEVICE_BASE + 0x138)
/** USB_OTG_DEVICE_DIEPCTL2 OTG device endpoint-2 control register **/
#define USB_OTG_DEVICE_DIEPCTL2			MMIO32(USB_OTG_DEVICE_BASE + 0x140)
/** USB_OTG_DEVICE_DIEPINT2 device endpoint-2 interrupt register **/
#define USB_OTG_DEVICE_DIEPINT2			MMIO32(USB_OTG_DEVICE_BASE + 0x148)
/** USB_OTG_DEVICE_DIEPTSIZ2 device endpoint-2 transfer size register **/
#define USB_OTG_DEVICE_DIEPTSIZ2			MMIO32(USB_OTG_DEVICE_BASE + 0x150)
/** USB_OTG_DEVICE_DTXFSTS2 OTG_FS device IN endpoint transmit FIFO status register **/
#define USB_OTG_DEVICE_DTXFSTS2			MMIO32(USB_OTG_DEVICE_BASE + 0x158)
/** USB_OTG_DEVICE_DIEPCTL3 OTG device endpoint-3 control register **/
#define USB_OTG_DEVICE_DIEPCTL3			MMIO32(USB_OTG_DEVICE_BASE + 0x160)
/** USB_OTG_DEVICE_DIEPINT3 device endpoint-3 interrupt register **/
#define USB_OTG_DEVICE_DIEPINT3			MMIO32(USB_OTG_DEVICE_BASE + 0x168)
/** USB_OTG_DEVICE_DIEPTSIZ3 device endpoint-3 transfer size register **/
#define USB_OTG_DEVICE_DIEPTSIZ3			MMIO32(USB_OTG_DEVICE_BASE + 0x170)
/** USB_OTG_DEVICE_DTXFSTS3 OTG_FS device IN endpoint transmit FIFO status register **/
#define USB_OTG_DEVICE_DTXFSTS3			MMIO32(USB_OTG_DEVICE_BASE + 0x178)
/** USB_OTG_DEVICE_DOEPCTL0 device endpoint-0 control register **/
#define USB_OTG_DEVICE_DOEPCTL0			MMIO32(USB_OTG_DEVICE_BASE + 0x300)
/** USB_OTG_DEVICE_DOEPINT0 device endpoint-0 interrupt register **/
#define USB_OTG_DEVICE_DOEPINT0			MMIO32(USB_OTG_DEVICE_BASE + 0x308)
/** USB_OTG_DEVICE_DOEPTSIZ0 device OUT endpoint-0 transfer size register **/
#define USB_OTG_DEVICE_DOEPTSIZ0			MMIO32(USB_OTG_DEVICE_BASE + 0x310)
/** USB_OTG_DEVICE_DOEPCTL1 device endpoint-1 control register **/
#define USB_OTG_DEVICE_DOEPCTL1			MMIO32(USB_OTG_DEVICE_BASE + 0x320)
/** USB_OTG_DEVICE_DOEPINT1 device endpoint-1 interrupt register **/
#define USB_OTG_DEVICE_DOEPINT1			MMIO32(USB_OTG_DEVICE_BASE + 0x328)
/** USB_OTG_DEVICE_DOEPTSIZ1 device OUT endpoint-1 transfer size register **/
#define USB_OTG_DEVICE_DOEPTSIZ1			MMIO32(USB_OTG_DEVICE_BASE + 0x330)
/** USB_OTG_DEVICE_DOEPCTL2 device endpoint-2 control register **/
#define USB_OTG_DEVICE_DOEPCTL2			MMIO32(USB_OTG_DEVICE_BASE + 0x340)
/** USB_OTG_DEVICE_DOEPINT2 device endpoint-2 interrupt register **/
#define USB_OTG_DEVICE_DOEPINT2			MMIO32(USB_OTG_DEVICE_BASE + 0x348)
/** USB_OTG_DEVICE_DOEPTSIZ2 device OUT endpoint-2 transfer size register **/
#define USB_OTG_DEVICE_DOEPTSIZ2			MMIO32(USB_OTG_DEVICE_BASE + 0x350)
/** USB_OTG_DEVICE_DOEPCTL3 device endpoint-3 control register **/
#define USB_OTG_DEVICE_DOEPCTL3			MMIO32(USB_OTG_DEVICE_BASE + 0x360)
/** USB_OTG_DEVICE_DOEPINT3 device endpoint-3 interrupt register **/
#define USB_OTG_DEVICE_DOEPINT3			MMIO32(USB_OTG_DEVICE_BASE + 0x368)
/** USB_OTG_DEVICE_DOEPTSIZ3 device OUT endpoint-3 transfer size register **/
#define USB_OTG_DEVICE_DOEPTSIZ3			MMIO32(USB_OTG_DEVICE_BASE + 0x370)

/**@}*/


/** @defgroup usb_otg_device_fs_dcfg FSDCFG OTG_FS device configuration register (OTG_FS_DCFG)
@{*/


#define USB_OTG_DEVICE_FS_DCFG_PFIVL_SHIFT		11
#define USB_OTG_DEVICE_FS_DCFG_PFIVL_MASK		0x03
/** @defgroup usb_otg_device_fs_dcfg_pfivl PFIVL Periodic frame interval
@{*/
/**@}*/


#define USB_OTG_DEVICE_FS_DCFG_DAD_SHIFT		4
#define USB_OTG_DEVICE_FS_DCFG_DAD_MASK		0x7f
/** @defgroup usb_otg_device_fs_dcfg_dad DAD Device address
@{*/
/**@}*/

/** USB_OTG_DEVICE_FS_DCFG_NZLSOHSK Non-zero-length status OUT handshake **/
#define USB_OTG_DEVICE_FS_DCFG_NZLSOHSK		(1 << 2)

#define USB_OTG_DEVICE_FS_DCFG_DSPD_SHIFT		0
#define USB_OTG_DEVICE_FS_DCFG_DSPD_MASK		0x03
/** @defgroup usb_otg_device_fs_dcfg_dspd DSPD Device speed
@{*/
/**@}*/


/**@}*/

