grevaillot/svd_tools/headers/STM32F105xx/usb_otg_device.h
/** USB_OTG_DEVICE_FS_DIEPCTL0_STALL STALL handshake **/
#define USB_OTG_DEVICE_FS_DIEPCTL0_STALL		(1 << 21)

#define USB_OTG_DEVICE_FS_DIEPCTL0_EPTYP_SHIFT		18
#define USB_OTG_DEVICE_FS_DIEPCTL0_EPTYP_MASK		0x03
/** @defgroup usb_otg_device_fs_diepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** USB_OTG_DEVICE_FS_DIEPCTL0_NAKSTS NAK status **/
#define USB_OTG_DEVICE_FS_DIEPCTL0_NAKSTS		(1 << 17)
/** USB_OTG_DEVICE_FS_DIEPCTL0_USBAEP USB active endpoint **/
#define USB_OTG_DEVICE_FS_DIEPCTL0_USBAEP		(1 << 15)

#define USB_OTG_DEVICE_FS_DIEPCTL0_MPSIZ_SHIFT		0
#define USB_OTG_DEVICE_FS_DIEPCTL0_MPSIZ_MASK		0x03
/** @defgroup usb_otg_device_fs_diepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_diepint0 DIEPINT0 device endpoint-x interrupt register
@{*/

/** USB_OTG_DEVICE_DIEPINT0_TXFE TXFE **/
#define USB_OTG_DEVICE_DIEPINT0_TXFE		(1 << 7)
/** USB_OTG_DEVICE_DIEPINT0_INEPNE INEPNE **/
#define USB_OTG_DEVICE_DIEPINT0_INEPNE		(1 << 6)
/** USB_OTG_DEVICE_DIEPINT0_ITTXFE ITTXFE **/
#define USB_OTG_DEVICE_DIEPINT0_ITTXFE		(1 << 4)
/** USB_OTG_DEVICE_DIEPINT0_TOC TOC **/
#define USB_OTG_DEVICE_DIEPINT0_TOC		(1 << 3)
/** USB_OTG_DEVICE_DIEPINT0_EPDISD EPDISD **/
#define USB_OTG_DEVICE_DIEPINT0_EPDISD		(1 << 1)
/** USB_OTG_DEVICE_DIEPINT0_XFRC XFRC **/
#define USB_OTG_DEVICE_DIEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_device_dieptsiz0 DIEPTSIZ0 device endpoint-0 transfer size register
@{*/


#define USB_OTG_DEVICE_DIEPTSIZ0_PKTCNT_SHIFT		19
#define USB_OTG_DEVICE_DIEPTSIZ0_PKTCNT_MASK		0x03
/** @defgroup usb_otg_device_dieptsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_DEVICE_DIEPTSIZ0_XFRSIZ_SHIFT		0
#define USB_OTG_DEVICE_DIEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup usb_otg_device_dieptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_dtxfsts0 DTXFSTS0 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define USB_OTG_DEVICE_DTXFSTS0_INEPTFSAV_SHIFT		0
#define USB_OTG_DEVICE_DTXFSTS0_INEPTFSAV_MASK		0xffff
/** @defgroup usb_otg_device_dtxfsts0_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_diepctl1 DIEPCTL1 OTG device endpoint-1 control register
@{*/

/** USB_OTG_DEVICE_DIEPCTL1_EPENA EPENA **/
#define USB_OTG_DEVICE_DIEPCTL1_EPENA		(1 << 31)
/** USB_OTG_DEVICE_DIEPCTL1_EPDIS EPDIS **/
#define USB_OTG_DEVICE_DIEPCTL1_EPDIS		(1 << 30)
/** USB_OTG_DEVICE_DIEPCTL1_SODDFRM_SD1PID SODDFRM/SD1PID **/
#define USB_OTG_DEVICE_DIEPCTL1_SODDFRM_SD1PID		(1 << 29)
/** USB_OTG_DEVICE_DIEPCTL1_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define USB_OTG_DEVICE_DIEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** USB_OTG_DEVICE_DIEPCTL1_SNAK SNAK **/
#define USB_OTG_DEVICE_DIEPCTL1_SNAK		(1 << 27)
/** USB_OTG_DEVICE_DIEPCTL1_CNAK CNAK **/
#define USB_OTG_DEVICE_DIEPCTL1_CNAK		(1 << 26)

#define USB_OTG_DEVICE_DIEPCTL1_TXFNUM_SHIFT		22
#define USB_OTG_DEVICE_DIEPCTL1_TXFNUM_MASK		0x0f
/** @defgroup usb_otg_device_diepctl1_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** USB_OTG_DEVICE_DIEPCTL1_Stall Stall **/
#define USB_OTG_DEVICE_DIEPCTL1_Stall		(1 << 21)

#define USB_OTG_DEVICE_DIEPCTL1_EPTYP_SHIFT		18
#define USB_OTG_DEVICE_DIEPCTL1_EPTYP_MASK		0x03
/** @defgroup usb_otg_device_diepctl1_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** USB_OTG_DEVICE_DIEPCTL1_NAKSTS NAKSTS **/
#define USB_OTG_DEVICE_DIEPCTL1_NAKSTS		(1 << 17)
/** USB_OTG_DEVICE_DIEPCTL1_EONUM_DPID EONUM/DPID **/
#define USB_OTG_DEVICE_DIEPCTL1_EONUM_DPID		(1 << 16)
/** USB_OTG_DEVICE_DIEPCTL1_USBAEP USBAEP **/
#define USB_OTG_DEVICE_DIEPCTL1_USBAEP		(1 << 15)

#define USB_OTG_DEVICE_DIEPCTL1_MPSIZ_SHIFT		0
#define USB_OTG_DEVICE_DIEPCTL1_MPSIZ_MASK		0x7ff
/** @defgroup usb_otg_device_diepctl1_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_diepint1 DIEPINT1 device endpoint-1 interrupt register
@{*/

/** USB_OTG_DEVICE_DIEPINT1_TXFE TXFE **/
#define USB_OTG_DEVICE_DIEPINT1_TXFE		(1 << 7)
/** USB_OTG_DEVICE_DIEPINT1_INEPNE INEPNE **/
#define USB_OTG_DEVICE_DIEPINT1_INEPNE		(1 << 6)
/** USB_OTG_DEVICE_DIEPINT1_ITTXFE ITTXFE **/
#define USB_OTG_DEVICE_DIEPINT1_ITTXFE		(1 << 4)
/** USB_OTG_DEVICE_DIEPINT1_TOC TOC **/
#define USB_OTG_DEVICE_DIEPINT1_TOC		(1 << 3)
/** USB_OTG_DEVICE_DIEPINT1_EPDISD EPDISD **/
#define USB_OTG_DEVICE_DIEPINT1_EPDISD		(1 << 1)
/** USB_OTG_DEVICE_DIEPINT1_XFRC XFRC **/
#define USB_OTG_DEVICE_DIEPINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_device_dieptsiz1 DIEPTSIZ1 device endpoint-1 transfer size register
@{*/


#define USB_OTG_DEVICE_DIEPTSIZ1_MCNT_SHIFT		29
#define USB_OTG_DEVICE_DIEPTSIZ1_MCNT_MASK		0x03
/** @defgroup usb_otg_device_dieptsiz1_mcnt MCNT Multi count
@{*/
/**@}*/


#define USB_OTG_DEVICE_DIEPTSIZ1_PKTCNT_SHIFT		19
#define USB_OTG_DEVICE_DIEPTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_device_dieptsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_DEVICE_DIEPTSIZ1_XFRSIZ_SHIFT		0
#define USB_OTG_DEVICE_DIEPTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_device_dieptsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_dtxfsts1 DTXFSTS1 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define USB_OTG_DEVICE_DTXFSTS1_INEPTFSAV_SHIFT		0
#define USB_OTG_DEVICE_DTXFSTS1_INEPTFSAV_MASK		0xffff
/** @defgroup usb_otg_device_dtxfsts1_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_diepctl2 DIEPCTL2 OTG device endpoint-2 control register
@{*/

/** USB_OTG_DEVICE_DIEPCTL2_EPENA EPENA **/
#define USB_OTG_DEVICE_DIEPCTL2_EPENA		(1 << 31)
/** USB_OTG_DEVICE_DIEPCTL2_EPDIS EPDIS **/
#define USB_OTG_DEVICE_DIEPCTL2_EPDIS		(1 << 30)
/** USB_OTG_DEVICE_DIEPCTL2_SODDFRM SODDFRM **/
#define USB_OTG_DEVICE_DIEPCTL2_SODDFRM		(1 << 29)
/** USB_OTG_DEVICE_DIEPCTL2_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define USB_OTG_DEVICE_DIEPCTL2_SD0PID_SEVNFRM		(1 << 28)
/** USB_OTG_DEVICE_DIEPCTL2_SNAK SNAK **/
#define USB_OTG_DEVICE_DIEPCTL2_SNAK		(1 << 27)
/** USB_OTG_DEVICE_DIEPCTL2_CNAK CNAK **/
#define USB_OTG_DEVICE_DIEPCTL2_CNAK		(1 << 26)

#define USB_OTG_DEVICE_DIEPCTL2_TXFNUM_SHIFT		22
#define USB_OTG_DEVICE_DIEPCTL2_TXFNUM_MASK		0x0f
/** @defgroup usb_otg_device_diepctl2_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** USB_OTG_DEVICE_DIEPCTL2_Stall Stall **/
#define USB_OTG_DEVICE_DIEPCTL2_Stall		(1 << 21)

#define USB_OTG_DEVICE_DIEPCTL2_EPTYP_SHIFT		18
#define USB_OTG_DEVICE_DIEPCTL2_EPTYP_MASK		0x03
/** @defgroup usb_otg_device_diepctl2_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** USB_OTG_DEVICE_DIEPCTL2_NAKSTS NAKSTS **/
#define USB_OTG_DEVICE_DIEPCTL2_NAKSTS		(1 << 17)
/** USB_OTG_DEVICE_DIEPCTL2_EONUM_DPID EONUM/DPID **/
#define USB_OTG_DEVICE_DIEPCTL2_EONUM_DPID		(1 << 16)
/** USB_OTG_DEVICE_DIEPCTL2_USBAEP USBAEP **/
#define USB_OTG_DEVICE_DIEPCTL2_USBAEP		(1 << 15)

