grevaillot/svd_tools/headers/STM32F105xx/usb_otg_device.h
/** USB_OTG_DEVICE_DOEPCTL3_EPENA EPENA **/
#define USB_OTG_DEVICE_DOEPCTL3_EPENA		(1 << 31)
/** USB_OTG_DEVICE_DOEPCTL3_EPDIS EPDIS **/
#define USB_OTG_DEVICE_DOEPCTL3_EPDIS		(1 << 30)
/** USB_OTG_DEVICE_DOEPCTL3_SODDFRM SODDFRM **/
#define USB_OTG_DEVICE_DOEPCTL3_SODDFRM		(1 << 29)
/** USB_OTG_DEVICE_DOEPCTL3_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define USB_OTG_DEVICE_DOEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** USB_OTG_DEVICE_DOEPCTL3_SNAK SNAK **/
#define USB_OTG_DEVICE_DOEPCTL3_SNAK		(1 << 27)
/** USB_OTG_DEVICE_DOEPCTL3_CNAK CNAK **/
#define USB_OTG_DEVICE_DOEPCTL3_CNAK		(1 << 26)
/** USB_OTG_DEVICE_DOEPCTL3_Stall Stall **/
#define USB_OTG_DEVICE_DOEPCTL3_Stall		(1 << 21)
/** USB_OTG_DEVICE_DOEPCTL3_SNPM SNPM **/
#define USB_OTG_DEVICE_DOEPCTL3_SNPM		(1 << 20)

#define USB_OTG_DEVICE_DOEPCTL3_EPTYP_SHIFT		18
#define USB_OTG_DEVICE_DOEPCTL3_EPTYP_MASK		0x03
/** @defgroup usb_otg_device_doepctl3_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** USB_OTG_DEVICE_DOEPCTL3_NAKSTS NAKSTS **/
#define USB_OTG_DEVICE_DOEPCTL3_NAKSTS		(1 << 17)
/** USB_OTG_DEVICE_DOEPCTL3_EONUM_DPID EONUM/DPID **/
#define USB_OTG_DEVICE_DOEPCTL3_EONUM_DPID		(1 << 16)
/** USB_OTG_DEVICE_DOEPCTL3_USBAEP USBAEP **/
#define USB_OTG_DEVICE_DOEPCTL3_USBAEP		(1 << 15)

#define USB_OTG_DEVICE_DOEPCTL3_MPSIZ_SHIFT		0
#define USB_OTG_DEVICE_DOEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup usb_otg_device_doepctl3_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_device_doepint3 DOEPINT3 device endpoint-3 interrupt register
@{*/

/** USB_OTG_DEVICE_DOEPINT3_B2BSTUP B2BSTUP **/
#define USB_OTG_DEVICE_DOEPINT3_B2BSTUP		(1 << 6)
/** USB_OTG_DEVICE_DOEPINT3_OTEPDIS OTEPDIS **/
#define USB_OTG_DEVICE_DOEPINT3_OTEPDIS		(1 << 4)
/** USB_OTG_DEVICE_DOEPINT3_STUP STUP **/
#define USB_OTG_DEVICE_DOEPINT3_STUP		(1 << 3)
/** USB_OTG_DEVICE_DOEPINT3_EPDISD EPDISD **/
#define USB_OTG_DEVICE_DOEPINT3_EPDISD		(1 << 1)
/** USB_OTG_DEVICE_DOEPINT3_XFRC XFRC **/
#define USB_OTG_DEVICE_DOEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_device_doeptsiz3 DOEPTSIZ3 device OUT endpoint-3 transfer size register
@{*/


#define USB_OTG_DEVICE_DOEPTSIZ3_RXDPID_STUPCNT_SHIFT		29
#define USB_OTG_DEVICE_DOEPTSIZ3_RXDPID_STUPCNT_MASK		0x03
/** @defgroup usb_otg_device_doeptsiz3_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define USB_OTG_DEVICE_DOEPTSIZ3_PKTCNT_SHIFT		19
#define USB_OTG_DEVICE_DOEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_device_doeptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_DEVICE_DOEPTSIZ3_XFRSIZ_SHIFT		0
#define USB_OTG_DEVICE_DOEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_device_doeptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/
